#include "Com_tim.h"

void Driver_TIM2_Init(void)
{
    //打开中断
    EA = 1; //总中断开关
    ET2 = 1; //定时器2中断允许
    //配置定时器2时钟源和工作模式
    C_T2 = 0; //定时器2使用内部时钟
    RCLK = 0; 
    TCLK = 0; 
    CP_RL2 = 1; //定时器2自动重载
    EXEN2 = 0; //定时器2不使用外部事件触发
    //配置定时器2的初始值和重载值
    //计算出定时器加1的时间为11.0592MHz/12=921600Hz，即每1.085微秒
    //中断溢出时间1ms=1000微秒/1.085微秒=921.6个计数周期，取整数922
    TL2 = 65536 - 922; 
    TH2 = (65536 - 922) >> 8; 
    RCAP2H = (65536 - 922) >> 8; //重载高8位
    RCAP2L = 65536 - 922; //重载低8位
    //开始计数
    TR2 = 1; //启动定时器2
    //设置定时器2中断优先级(default:0)
}